SOAP_test/SOAP_testing.postman_collection

{
  "info": {
    "_postman_id": "1055f775-a3f9-4030-bd25-28d0f93c1f86",
    "name": "SOAP_testing",
    "schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
    "_exporter_id": "27575758"
  },
  "item": [
    {
      "name": "200 ListOfContinentsByName",
      "event": [
        {
          "listen": "test",
          "script": {
            "exec": [
              "pm.test(\"Status code is 200\", function () {\r",
              "    pm.response.to.have.status(200);\r",
              "});\r",
              "\r",
              "pm.test(\"Content-Type — SOAP+XML\", function () {\r",
              "    pm.expect(pm.response.headers.get(\"Content-Type\")).to.include(\"application/soap+xml\");\r",
              "});\r",
              "\r",
              "pm.test(\"Response includes SOAP Envelope with Body\", function () {\r",
              "    const responseXml = pm.response.text();\r",
              "\r",
              "    pm.expect(responseXml).to.include(\"<soap:Envelope\");\r",
              "    pm.expect(responseXml).to.include(\"<soap:Body\");\r",
              "});"
            ],
            "type": "text/javascript",
            "packages": {},
            "requests": {}
          }
        }
      ],
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/soap+xml",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <ListOfContinentsByName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\"/>\r\n    </Body>\r\n</Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso",
          "protocol": "http",
          "host": [
            "webservices",
            "oorsprong",
            "org"
          ],
          "path": [
            "websamples.countryinfo",
            "CountryInfoService.wso"
          ]
        }
      },
      "response": []
    },
    {
      "name": "200 CountryName",
      "event": [
        {
          "listen": "test",
          "script": {
            "exec": [
              "pm.test(\"Status code is 200\", function () {\r",
              "    pm.response.to.have.status(200);\r",
              "});\r",
              "\r",
              "pm.test(\"Content-Type — SOAP+XML\", function () {\r",
              "    pm.expect(pm.response.headers.get(\"Content-Type\")).to.include(\"application/soap+xml\");\r",
              "});\r",
              "\r",
              "pm.test(\"Response includes SOAP Envelope with Body\", function () {\r",
              "    const responseXml = pm.response.text();\r",
              "\r",
              "    pm.expect(responseXml).to.include(\"<soap:Envelope\");\r",
              "    pm.expect(responseXml).to.include(\"<soap:Body\");\r",
              "});"
            ],
            "type": "text/javascript",
            "packages": {},
            "requests": {}
          }
        }
      ],
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/soap+xml",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <CountryName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sCountryISOCode>RUS</sCountryISOCode>\r\n        </CountryName>\r\n    </Body>\r\n</Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso",
          "protocol": "http",
          "host": [
            "webservices",
            "oorsprong",
            "org"
          ],
          "path": [
            "websamples.countryinfo",
            "CountryInfoService.wso"
          ]
        }
      },
      "response": []
    },
    {
      "name": "200 FullCountryInfo",
      "event": [
        {
          "listen": "test",
          "script": {
            "exec": [
              "pm.test(\"Status code is 200\", function () {\r",
              "    pm.response.to.have.status(200);\r",
              "});\r",
              "\r",
              "pm.test(\"Content-Type — SOAP+XML\", function () {\r",
              "    pm.expect(pm.response.headers.get(\"Content-Type\")).to.include(\"application/soap+xml\");\r",
              "});\r",
              "\r",
              "pm.test(\"Response includes SOAP Envelope with Body\", function () {\r",
              "    const responseXml = pm.response.text();\r",
              "\r",
              "    pm.expect(responseXml).to.include(\"<soap:Envelope\");\r",
              "    pm.expect(responseXml).to.include(\"<soap:Body\");\r",
              "});"
            ],
            "type": "text/javascript",
            "packages": {},
            "requests": {}
          }
        }
      ],
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/soap+xml",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <FullCountryInfo xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sCountryISOCode>RUS</sCountryISOCode>\r\n        </FullCountryInfo>\r\n    </Body>\r\n</Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso",
          "protocol": "http",
          "host": [
            "webservices",
            "oorsprong",
            "org"
          ],
          "path": [
            "websamples.countryinfo",
            "CountryInfoService.wso"
          ]
        }
      },
      "response": []
    },
    {
      "name": "200 LanguageName",
      "event": [
        {
          "listen": "test",
          "script": {
            "exec": [
              "pm.test(\"Status code is 200\", function () {\r",
              "    pm.response.to.have.status(200);\r",
              "});\r",
              "\r",
              "pm.test(\"Content-Type — SOAP+XML\", function () {\r",
              "    pm.expect(pm.response.headers.get(\"Content-Type\")).to.include(\"application/soap+xml\");\r",
              "});\r",
              "\r",
              "pm.test(\"Response includes SOAP Envelope with Body\", function () {\r",
              "    const responseXml = pm.response.text();\r",
              "\r",
              "    pm.expect(responseXml).to.include(\"<soap:Envelope\");\r",
              "    pm.expect(responseXml).to.include(\"<soap:Body\");\r",
              "});"
            ],
            "type": "text/javascript",
            "packages": {},
            "requests": {}
          }
        }
      ],
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "application/soap+xml",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n    <Body>\r\n        <LanguageName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n            <sISOCode>RUS</sISOCode>\r\n        </LanguageName>\r\n    </Body>\r\n</Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso",
          "protocol": "http",
          "host": [
            "webservices",
            "oorsprong",
            "org"
          ],
          "path": [
            "websamples.countryinfo",
            "CountryInfoService.wso"
          ]
        }
      },
      "response": []
    }
  ]
}
